app/Controllers/Categorias.php

SELECT *
FROM `categoria`
---
    public function listar(){                                                      //função usada para o listar os arquivos capturados no upload //
        $categoriaModel = new \App\Models\CategoriaModel();                        // Seta as validaçoes do banco
        $data['categorias'] = $categoriaModel->findAll();                          //pega todas as informaçoes do banco

INSERT INTO `categoria` (`nome`, `endereco`, `foto`) VALUES ('Nathan Oliveira do Nascimento', 'rua 4 , 265, jd planalto', '1643876026_63247618d636369d1157.jpg')
---
            $categoriaModel->set('endereco',$this->request->getPost('endereco'));//salva os dados no banco de dados
            $categoriaModel->set('foto',$novoNome );                           //salva os dados no banco de dados

                    if ( $categoriaModel->insert()) {                          // se a variavel for setada entra no if

SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '94'
---
    public function editar($id){                                           // id

        $data['titulo'] = '<p style="margin-left:50px">Editar Aluno </p>' ;
        $data['acao'] = 'Editar';
        $data['msg'] = '';
        $categoriaModel = new \App\Models\CategoriaModel();               // Seta as validaçoes do banco
        $categoria = $categoriaModel->find($id);                          // recebe o id do cadastro que queremos editar

UPDATE `categoria` SET `nome` = 'Pedro Generoso de Oliveira', `endereco` = 'Luiz Marques Rabelo,1356, Campos Gerais-MG', `foto` = '1643862150_9f894e4b2bf3f7ddf3f2.jpg'
WHERE `categoria`.`id` IN ('94')
---



            if($categoriaModel->update($id, $categoria)){                          // atualiza o registro